{
  "experiences": [
    {
      "jobTitle": "Software Engineer",
      "organization": "Open Government Products",
      "details": [
        "Integrated PKCE protocol into sgID and launched the TypeScript SDK major release, including the oversight of user roll-out plan.",
        "Built the Rules Engine prototype for sgID which allows users to define and consume dynamic derived data.",
        "Worked on CalSG to improve the functionality of slot booking and onboarding flow."
      ],
      "techStack": ["JavaScript", "TypeScript", "React"],
      "startDate": "2023-03-20"
    },
    {
      "jobTitle": "Software Engineer",
      "organization": "Meta",
      "details": [
        "Took full ownership of the content reviewing system for political human review workflows.",
        "Successfully launched multiple features after conducting A/B testing and statistical analysis.",
        "Experiment results have shown to improve average job handling time by ~10%.",
        "Notable features include integrating ML signals into the reviewing process.",
        "Constructed data pipelines for injection of quality assurance review jobs."
      ],
      "techStack": ["JavaScript", "TypeScript", "React", "PHP", "Python"],
      "startDate": "2022-07-11",
      "endDate": "2022-12-11"
    },
    {
      "jobTitle": "Software Engineer Intern",
      "organization": "Hodlnaut",
      "details": [
        "Designed and built an MVP for an over-the-counter trading simulator for various cryptocurrencies.",
        "Built Web Sockets & REST API’s for users to retrieve the order books from the server & to place various order requests."
      ],
      "techStack": ["JavaScript", "TypeScript", "Express"],
      "startDate": "2022-11-01",
      "endDate": "2023-01-11"
    },
    {
      "jobTitle": "Quantitative Developer Intern",
      "organization": "Squarepoint Capital",
      "details": [
        "Worked on the full stack of a time-series data analysis/forecasting web application.",
        "Design an advanced search functionality that utilizes Django’s Queryset API.",
        "Transform time-series data and plot the result on the Angular app.",
        "Create a frontend sandbox which allows users to perform mathematical operations on multiple time-series datasets."
      ],
      "techStack": ["TypeScript", "Python", "Angular", "Django", "PostgreSQL"],
      "startDate": "2022-05-01",
      "endDate": "2023-08-11"
    }
  ]
}
